{"text": "Bell offers the \"Migration Special - From Virgin Plus\" mobile plan at a discounted price of $45 per month, down from the original price of $80. This plan is available through a migration from Virgin Plus and includes a $10 discount for enrolling in Autopay. It provides 120 GB of high-speed data on a 5G+ network, with unlimited data at reduced speeds of 512 Kbps after the high-speed limit is reached. Hotspot capabilities are included, though the data is not shareable. The plan features unlimited calling within Canada and to the US, along with 1,000 international minutes to 27 countries. Texting is unlimited for Canada, the US, and internationally. Streaming is enhanced with HD video capabilities and includes Crave Basic. Additional perks of this plan are access to the 5G+ network, HD video streaming, hotspot capabilities, and a waived activation fee.", "metadata": {"activation_fee": false, "autopay_method": "bank account", "best_buy_gc": "$50", "migration_from": "Virgin Plus", "provider": "Bell", "plan_name": "Migration Special - From Virgin Plus"}}
{"text": "Bell offers the \"Migration Premium - From Virgin Plus\" plan for $60.00 per month, reduced from the original price of $90.00 through the Virgin Plus to Bell migration offer and a $10 Autopay discount. This plan provides 200 GB of high-speed data with 5G+ connectivity, after which speeds are reduced to 512 Kbps with unlimited reduced speed, and it also allows hotspot usage that can be shared. Customers benefit from unlimited calls within Canada and to the U.S. as well as unlimited international minutes to 27 countries, with roaming coverage available in Canada and the U.S. Text messaging is unlimited for Canada, the U.S., and internationally. Streaming services include HD video and access to Crave Basic, along with a one-year subscription to Perplexity Pro AI. Additional perks include access to the 5G+ network, waived activation fee, HD video streaming, hotspot capabilities, and priority customer support.", "metadata": {"activation_fee": false, "autopay_method": "bank account", "best_buy_gc": "$50", "migration_from": "Virgin Plus", "provider": "Bell", "plan_name": "Migration Premium - From Virgin Plus"}}
{"text": "Rogers offers the \"Migration Ultimate - From Fido\" plan for $65 per month, discounted from the original price of $100. This plan is part of a Fido to Rogers migration offer and includes a $10 discount for Autopay, as well as a potential family plan discount. Customers receive 300 GB of high-speed 5G/5G+ data, with unlimited reduced speed available at 512 Kbps when the high-speed data is exhausted. Hotspot usage is allowed, and the data can be shared. The calling features include unlimited calling within Canada and the US, infinite international minutes to 27 countries, and roaming available in Canada and 64 destinations. Texting is unlimited within Canada and the US, as well as for international messages. For streaming, subscribers benefit from HD video and receive three months of Sportsnet+ for free. Additional perks include a Rogers Satellite, 3% cash back with the Rogers Red card, 50% off Roam like Home, 30% off Device Protection, and waived activation fees.", "metadata": {"activation_fee": false, "autopay_method": "credit, debit, bank account", "best_buy_gc": "$50", "migration_from": "Fido", "provider": "Rogers", "plan_name": "Migration Ultimate - From Fido"}}
{"text": "Rogers offers the \"Migration Premium Plus - From Fido\" plan at $55 per month, reduced from the original price of $85. This plan is available for customers migrating from Fido and includes a discount for those who enroll in Autopay. The plan features 180 GB of high-speed 5G data with unlimited reduced speed at 512 Kbps, as well as hotspot capabilities and the ability to share data. It provides unlimited calling within Canada and to the U.S., along with unlimited international minutes to 27 countries. Texting is unlimited for Canada, the U.S., and internationally. Streaming is supported in HD video, although no specific streaming services are included. Additional perks of the plan include 3% cash back with the Rogers Red card, 50% off the \"Roam like home\" feature, and no activation fee.", "metadata": {"activation_fee": false, "autopay_method": "credit, debit, bank account", "best_buy_gc": "$50", "migration_from": "Fido", "provider": "Rogers", "plan_name": "Migration Premium Plus - From Fido"}}
{"text": "Telus offers a mobile plan called \"Migration 5G+ Complete - From Koodo\" for a monthly price of $70, down from the original price of $90, available through a Koodo to Telus migration offer and $10 Autopay discount. This plan features 150 GB of high-speed data with 5G+ speeds, unlimited reduced speed data thereafter, hotspot capabilities, and shareable data. Customers enjoy unlimited calling within Canada and the U.S., unlimited international calling to 27 countries, and unlimited texting to Canada, the U.S., and internationally. The plan supports HD video streaming and includes perks such as premium financing with device discounts, a 5-Year Rate Plan Price Lock, Easy Roam starting at $5 per day, blazing-fast speeds up to 2Gbps, and a waived activation fee.", "metadata": {"activation_fee": false, "autopay_method": "bank account", "best_buy_gc": "$50", "migration_from": "Koodo", "provider": "Telus", "plan_name": "Migration 5G+ Complete - From Koodo"}}
{"text": "Telus offers the \"Migration 5G+ Explore - From Koodo\" plan for $95 per month, a discount from its original price of $120. This plan is available through a Koodo to Telus migration offer and includes a $10 discount for customers on Autopay. Subscribers enjoy 300 GB of high-speed 5G+ data, with unlimited reduced speed after reaching the limit. The plan also allows for hotspot usage and data sharing. Customers can make unlimited calls within Canada and to the US, alongside unlimited international minutes to 68 countries and roaming in both Canada and those same international destinations. Texting is unlimited across Canada, the US, and internationally as well. Streaming capabilities include HD video, and although there are no included streaming services, subscribers benefit from additional perks like premium financing with device discounts, a 5-Year Rate Plan Price Lock, Easy Roam starting at $5 per day, blazing-fast speeds up to 2Gbps, waived activation fees, and priority support.", "metadata": {"activation_fee": false, "autopay_method": "bank account", "best_buy_gc": "$50", "migration_from": "Koodo", "provider": "Telus", "plan_name": "Migration 5G+ Explore - From Koodo"}}
{"text": "Virgin Plus offers the \"Prepaid to Postpaid - From Lucky Mobile\" plan at a price of $20.00 per month, reduced from the original price of $45.00. This discount applies if you migrate from Lucky Mobile to Virgin Plus and set up a $10 Autopay. The plan includes 50 GB of high-speed data at 4G LTE speed and allows hotspot usage, although the data is not shareable with others. It features unlimited calling within Canada, 1000 international minutes to 27 countries, and roaming exclusively in Canada. Text messaging is unlimited within Canada and internationally. However, HD video streaming is not included, and there are no specific streaming services provided. Additional perks of the plan include Call Display, Voicemail, Call Waiting, Conference Calling, Suspicious Call Detection, and a waived activation fee.", "metadata": {"activation_fee": false, "autopay_method": "debit", "best_buy_gc": "$50", "migration_from": "Lucky Mobile", "provider": "Virgin Plus", "plan_name": "Prepaid to Postpaid - From Lucky Mobile"}}
{"text": "Virgin Plus offers a mobile plan called \"Prepaid to Postpaid Premium - From Lucky Mobile\" at a monthly price of $35, down from the original price of $50. This discounted price is available if you migrate from Lucky Mobile to Virgin Plus and set up an Autopay account for an additional $10 credit. The plan provides 80 GB of high-speed data on a 5G network with hotspot capabilities, although the data is not shareable. You get unlimited calling within Canada and 1,000 international minutes to 27 countries, while calls to the U.S. are not included. Texting is unlimited within Canada and internationally. The plan supports HD video streaming, although no specific streaming services are included. Additional perks include Call Display, Voicemail, Call Waiting, Conference Calling, suspicious call detection, 5G access, and a waived activation fee.", "metadata": {"activation_fee": false, "autopay_method": "bank account", "best_buy_gc": "$50", "migration_from": "Lucky Mobile", "provider": "Virgin Plus", "plan_name": "Prepaid to Postpaid Premium - From Lucky Mobile"}}
{"text": "Fido offers a mobile plan named \"Prepaid to Postpaid - From Chatr\" at a monthly price of $35, down from the original price of $45, with discounts available for Chatr to Fido migration and a $10 Autopay. This plan includes 50 GB of high-speed 4G LTE data, with the option to use your data as a hotspot, though the data is not shareable. It provides unlimited calling within Canada and includes 500 international calling minutes to select countries, while roaming is limited to Canada. The plan offers unlimited texting within Canada, but does not include unlimited texting or calling to the US or internationally. Streaming options do not include HD video or any specific services. Additional perks of this plan include the ability to use your service abroad with Fido Roam, a waived activation fee, and 3% cash back with the Rogers Red credit card.", "metadata": {"activation_fee": false, "autopay_method": "credit, debit, bank account", "best_buy_gc": "$50", "migration_from": "Chatr", "provider": "Fido", "plan_name": "Prepaid to Postpaid - From Chatr"}}
{"text": "Fido offers the \"Prepaid to Postpaid Plus - From Chatr\" plan for $42.00 per month, down from the original price of $55.00, with discounts available for Chatr to Fido migration and signing up for $10 Autopay. This plan includes 80 GB of high-speed 4G LTE data with hotspot capabilities, though it is not shareable. It provides unlimited calling within Canada, 1,000 international minutes to various destinations, and unlimited texting in Canada and internationally. Customers can enjoy HD video streaming, and there are additional perks such as the ability to use the plan abroad with Fido Roam, a waived activation fee, and 3% cash back with the Rogers Red credit card.", "metadata": {"activation_fee": false, "autopay_method": "credit, debit, bank account", "best_buy_gc": "$50", "migration_from": "Chatr", "provider": "Fido", "plan_name": "Prepaid to Postpaid Plus - From Chatr"}}
{"text": "Koodo offers a mobile plan named \"Prepaid to Postpaid - From Koodo Prepaid\" at a monthly price of $38, down from the original price of $50, with a discount available for Koodo Prepaid to Koodo Postpaid migration and an additional $10 Autopay discount. This plan includes 75 GB of high-speed 5G data with hotspot capability, although the data is not shareable. Customers benefit from unlimited calling within Canada, unlimited texting in Canada, and unlimited international texting. While calling is not unlimited to the US, the plan provides unlimited international minutes to select countries and includes roaming within Canada. HD video streaming is supported, and there are additional perks such as Shock-Free Data, the option to choose one free perk like an Unlimited Long Distance Pack, and a waived activation fee.", "metadata": {"activation_fee": false, "autopay_method": "bank account", "best_buy_gc": "$50", "migration_from": "Koodo Prepaid", "provider": "Koodo", "plan_name": "Prepaid to Postpaid - From Koodo Prepaid"}}
{"text": "Koodo offers a mobile plan named \"Prepaid to Postpaid Premium - From Koodo Prepaid\" for $43 per month, reduced from an original price of $60 under certain discount conditions such as migrating from Koodo Prepaid and signing up for $10 Autopay. This plan includes 100 GB of high-speed 5G data with unlimited reduced speed and hotspot capabilities, though it is not shareable. Customers enjoy unlimited calling within Canada, international minutes to 27 countries, and unlimited texting in Canada and internationally. High-definition video streaming is supported, and the plan includes additional perks like Shock-Free Data, one free perk choice (Unlimited Long Distance Pack), Easy Roam availability, and a waived activation fee.", "metadata": {"activation_fee": false, "autopay_method": "bank account", "best_buy_gc": "$50", "migration_from": "Koodo Prepaid", "provider": "Koodo", "plan_name": "Prepaid to Postpaid Premium - From Koodo Prepaid"}}
