{"text": "The Bell Select mobile plan is offered at a monthly price of $55, down from the original price of $80, with available discounts for bundling with Internet and enrolling in Autopay. This plan is set to expire on October 6, 2025. It includes 100 GB of high-speed 5G+ data, with unlimited reduced speed at 512 Kbps after the data limit is reached, and hotspot capabilities, although data cannot be shared. Calling features include unlimited calls within Canada and to the U.S., along with 1,000 international minutes to 27 countries and roaming capabilities in Canada and the U.S. Texting is also unlimited, covering Canada, the U.S., and internationally. In terms of streaming, the plan offers HD video access and includes services like Crave Basic and a one-year subscription to Perplexity Pro AI. Additional perks of the plan include access to the 5G+ network, HD video streaming, and hotspot capabilities.", "metadata": {"activation_fee": true, "autopay_method": "bank account", "best_buy_gc": "$100", "provider": "Bell", "plan_name": "Select"}}
{"text": "Bell offers the Max - CAN/U.S. mobile plan for $65 per month, down from the original price of $90. This plan is available at a discounted rate when you bundle with Internet or sign up for $10 Autopay. The offer expires on October 6, 2025. It includes 175 GB of high-speed data with 5G+ connectivity, and after reaching the limit, the speed is reduced to 512 Kbps. Hotspot capabilities are available, however, the data is not shareable. Customers can enjoy unlimited calling in Canada and the U.S., along with 1000 international minutes to 27 countries and roaming between Canada and the U.S. Texting is unlimited both within Canada and the U.S., as well as internationally. The plan includes HD video streaming and access to services like Crave Basic and Perplexity Pro AI for one year. Additional perks of the plan include access to the 5G+ network, HD video streaming, and hotspot capabilities.", "metadata": {"activation_fee": true, "autopay_method": "bank account", "best_buy_gc": "$100", "provider": "Bell", "plan_name": "Max - CAN/U.S."}}
{"text": "Bell offers the \"Ultra - CAN/INT\" mobile plan for $80 per month, down from the original price of $105, with this discount valid when you bundle with Internet or sign up for $10 Autopay, and the offer expires on October 6, 2025. This plan includes 250 GB of high-speed data on a 5G+ network, with unlimited reduced speed at 512 Kbps and hotspot capabilities, although the data is not shareable. Customers enjoy unlimited calling within Canada and the U.S., with roaming available in Canada but no international minutes included. Texting is unlimited within Canada and internationally, but not to the U.S. The plan supports HD video streaming and includes access to Crave Basic and Perplexity Pro AI for one year. Additional perks include access to the 5G network.", "metadata": {"activation_fee": true, "autopay_method": "bank account", "best_buy_gc": "$100", "provider": "Bell", "plan_name": "Ultra - CAN/INT"}}
{"text": "Rogers offers the Essentials plan for $45 per month, which is a discount from the original price of $70. This plan is available under specific conditions, such as averaging four lines with Internet or TV service and signing up for $10 Autopay. The plan provides 250 GB of high-speed data on a 5G/5G+ network, with a maximum speed of 250 Mbps, and offers unlimited data at a reduced speed of 256 Kbps after the high-speed allotment is reached. Customers can enjoy unlimited calling within Canada and to the US, along with 27 international calling minutes and roaming in Canada and 64 destinations. Texting is unlimited for Canada, the US, and internationally. Streaming services are included, featuring HD video and three months free of Sportsnet+. Additional perks include Rogers Satellite after the beta trial, 3% cash back with a Rogers Red card, 50% off Roam Like Home, 30% off Device Protection, and the option to finance a tablet or smartwatch for $0 per month for 24 months.", "metadata": {"activation_fee": true, "autopay_method": "bank account", "best_buy_gc": "N/A", "provider": "Rogers", "plan_name": "Essentials"}}
{"text": "Rogers offers the \"Popular\" plan for $55 per month, reduced from the original price of $80, available under certain discount conditions such as an average per line for four lines and autopay savings. This plan provides 175 GB of high-speed data on a 5G network, with a maximum speed of 250 Mbps, after which the speed reduces to 256 Kbps. It includes unlimited calling within Canada and the US, 27 international minutes, and roaming in Canada and 64 other destinations. Text messaging is unlimited to Canada, the US, and internationally. The plan supports HD video streaming and comes with three months free of Sportsnet+. Additional perks include Rogers Satellite after the beta trial, 3% cash back with the Rogers Red card, 50% off Roam Like Home, 30% off Device Protection, and the option to finance a tablet or smartwatch for $0 per month over 24 months.", "metadata": {"activation_fee": true, "autopay_method": "credit, debit, bank account", "best_buy_gc": "N/A", "provider": "Rogers", "plan_name": "Popular"}}
{"text": "Telus offers the \"5G+ Complete\" mobile plan for $80 per month, which provides a discount from the original price of $90 with a $10 Autopay condition. This plan includes 100 GB of high-speed data at 5G+ speeds, with unlimited data available at reduced speeds of 256 Kbps after the high-speed limit is reached. Users can also utilize hotspot capabilities and share their data. For calling, customers enjoy unlimited calls within Canada, unlimited international texting, and unlimited international minutes to 27 countries, though calls to the US are not unlimited. The plan supports HD video streaming. Additional perks include premium financing options leading to device discounts, a 5-year rate plan price lock, nationwide data, talk, and text, as well as Easy Roam starting at $5 per day. Customers eligible for Home Services can access this plan from $65 per month.", "metadata": {"activation_fee": true, "autopay_method": "bank account", "best_buy_gc": "$80", "provider": "Telus", "plan_name": "5G+ Complete"}}
{"text": "Telus offers the \"5G+ Complete Canada-US\" mobile plan at a monthly price of $90, which is discounted from the original price of $100 if you enroll in Autopay. This plan features a high-speed data allowance of 175 GB with 5G+ speeds and includes unlimited reduced-speed data at 256 Kbps after the high-speed limit is reached. You can use hotspot capabilities and share the data with others. For calling, it provides unlimited calls within Canada and the U.S., along with unlimited international minutes to 27 countries and roaming in Canada and the U.S. Texting is also unlimited within Canada, the U.S., and internationally. Streaming in HD is available, and while there are no included services for streaming, the plan includes several additional perks such as premium financing options for device discounts, a 5-Year Rate Plan Price Lock, easy roaming starting at $5 per day, blazing-fast speeds up to 2 Gbps, and for eligible Home Services customers, the plan can start from just $75 per month.", "metadata": {"activation_fee": true, "autopay_method": "bank account", "best_buy_gc": "$80", "provider": "Telus", "plan_name": "5G+ Complete Canada-US"}}
{"text": "Telus offers the \"5G+ Complete Explore\" plan for $110 per month, down from its original price of $120, with a $10 discount available for those enrolled in Autopay. This plan includes 250 GB of high-speed data with 5G+ speed, after which the speed reduces to 256 Kbps. Users can utilize hotspot and share their data. Calling features include unlimited calls within Canada and the US, along with unlimited international minutes to 68 countries and roaming in Canada and those same international destinations. Texting is also unlimited within Canada, the US, and internationally. The plan supports HD video streaming and comes with several additional perks, such as premium financing with eligibility for device discounts, a 5-Year Rate Plan Price Lock, data, talk, and text usage in Canada and 68 international destinations, Easy Roam for $5 per day, and blazing-fast speeds of up to 2 Gbps. Eligible customers who subscribe to Home Services can benefit from this plan starting at $95 per month.", "metadata": {"activation_fee": true, "autopay_method": "bank account", "best_buy_gc": "$80", "provider": "Telus", "plan_name": "5G+ Complete Explore"}}
{"text": "Rogers offers the Ultimate mobile plan for $75 per month, reduced from the original price of $100, when certain conditions are met such as an average per line for four lines and subscribing to Internet or TV service, or signing up for $10 Autopay. This plan provides 250 GB of high-speed data with 5G/5G+ speeds up to 1 Gbps, with reduced speeds of 512 Kbps for unlimited reduced-speed data. Users can create a hotspot and share their data. The calling features include unlimited calls within Canada and to the U.S., along with 27 international calling minutes and roaming coverage in Canada and 64 destinations. Texting is unlimited for Canada, the U.S., and internationally. Customers can enjoy HD video streaming, and they will receive three months of Sportsnet+ for free. Additional perks include Rogers Satellite access following a beta trial, 3% cash back with the Rogers Red card, 50% off Roam Like Home, 30% off Device Protection, and the ability to finance a tablet or smartwatch for $0 a month for 24 months.", "metadata": {"activation_fee": true, "autopay_method": "credit, debit, bank account", "best_buy_gc": "N/A", "provider": "Rogers", "plan_name": "Ultimate"}}
{"text": "The Virgin Plus mobile plan named \"10GB data, talk & text\" is available for $40 per month, down from the original price of $50. This offer is valid for new activations only and includes a $10 discount for setting up Autopay. The plan will expire on October 6, 2025. It provides 10 GB of high-speed data, with hotspot capabilities being included. Users will enjoy unlimited calling within Canada, unlimited texting within Canada, and unlimited international texting. However, the plan does not include unlimited calling to the U.S. or international minutes. Additional perks include Call Display, Voicemail, Call Waiting, Conference Calling, and Suspicious Call Detection, along with a bonus of 10 GB of data.", "metadata": {"activation_fee": true, "autopay_method": "bank account", "best_buy_gc": "$50", "provider": "Virgin Plus", "plan_name": "10GB data, talk & text"}}
{"text": "Virgin Plus offers a mobile plan called \"40GB data, talk & text\" for $45.00 per month, down from the original price of $55.00. This price is available for new activations only and requires a $10 Autopay discount. The offer expires on October 6, 2025. The plan includes 40 GB of high-speed 4G data, which can be used as a hotspot. Calling is unlimited within Canada but does not include unlimited calling to the US. Texting is unlimited across Canada and offers unlimited international texting as well. The plan does not support HD video streaming and does not include specific streaming services. Additional perks of this plan incorporate Call Display, Voicemail, Call Waiting, Conference Calling, Suspicious call detection, and a bonus of 10GB of data.", "metadata": {"activation_fee": true, "autopay_method": "bank account", "best_buy_gc": "$50", "provider": "Virgin Plus", "plan_name": "40GB data, talk & text"}}
{"text": "Virgin Plus offers a mobile plan named \"60GB data, talk & text\" for $50 per month, down from the original price of $60. This promotional rate is available for new activations only and requires a $10 Autopay option. The offer expires on October 6, 2025. The plan includes 60 GB of high-speed 4G data and allows mobile hotspot usage. Customers enjoy unlimited calling within Canada, unlimited texting to Canadian numbers, and unlimited international texting. While calls to the US are not unlimited, the plan does not include calls to international destinations. Streaming services are not included, and HD video streaming is not supported. Additionally, the plan comes with perks such as Call Display, Voicemail, Call Waiting, Conference Calling, and Suspicious Call Detection.", "metadata": {"activation_fee": true, "autopay_method": "bank account", "best_buy_gc": "$50", "provider": "Virgin Plus", "plan_name": "60GB data, talk & text"}}
{"text": "Fido offers the \"2GB, Talk & Text - BYOP\" plan for $37.50 per month. This plan includes 2 GB of high-speed data at 4G LTE speeds, with a maximum speed of 150 Mbps. It provides unlimited calls across Canada but does not include unlimited calls to the U.S. or international minutes. Additionally, texting is unlimited within Canada, but there are no unlimited texting options to the U.S. or internationally. The plan does not support HD video streaming, and there are no included streaming services. Customers will enjoy perks such as Data Overage Protection, the ability to use the plan abroad with Fido Roam, and the option to add hotspot capabilities.", "metadata": {"activation_fee": true, "autopay_method": "credit, debit, bank account", "best_buy_gc": "N/A", "provider": "Fido", "plan_name": "2GB, Talk & Text - BYOP"}}
{"text": "Fido offers the \"3GB Basic Plan - BYOP\" for $39.00 per month, available until October 6, 2025. This plan includes 3 GB of high-speed data at a capped speed of 3 Mbps, with no options for hotspot or data sharing. Customers enjoy unlimited calling within Canada and to the U.S., along with 1000 international minutes to 27 countries; however, it does not support unlimited texting to the U.S. or internationally. The plan does not include HD video streaming, and additional perks include a $15 charge for every 100 MB of data overage, and it is noted that this plan is not suitable for HD streaming and gaming, and does not support Fido Roam.", "metadata": {"activation_fee": true, "autopay_method": "credit, debit, bank account", "best_buy_gc": "N/A", "provider": "Fido", "plan_name": "3GB Basic Plan - BYOP"}}
{"text": "Fido offers the \"10GB, Talk & Text - BYOP\" plan for $40 per month, down from the original price of $50, if you enroll in Autopay, which provides a discount of $10. This offer is valid until October 6, 2025. The plan includes 10 GB of high-speed data at 4G LTE speeds, with hotspot capability, but it is not shareable. Calling features include unlimited calls within Canada and the U.S., as well as 1000 international minutes to 27 countries, with roaming available in Canada and the U.S. Texting is unlimited within Canada, but not to the U.S. or internationally. The plan does not include HD video streaming or any included services. Additional perks include 500 international texts, the option to add hotspot services, 3% cash back with the Rogers Red credit card, a promotional bonus of 10 GB of data, and a promotional $0 hotspot offer.", "metadata": {"activation_fee": true, "autopay_method": "credit, debit, bank account", "best_buy_gc": "N/A", "provider": "Fido", "plan_name": "10GB, Talk & Text - BYOP"}}
{"text": "Fido offers a mobile plan named \"40GB, Talk & Text - BYOP\" for a monthly price of $45, down from the original price of $55, with eligibility for a $10 discount if you choose Autopay. This offer is valid until October 6, 2025. The plan includes 40 GB of high-speed 4G LTE data and allows hotspot usage. Calling features provide unlimited calls within Canada and the U.S., along with 1000 international minutes to 27 countries and roaming in Canada and the U.S. Texting is unlimited within Canada, while U.S. and international texting are not unlimited. Video streaming is not available in HD and there are no included streaming services. Additional perks include 500 international texts, the option for hotspot as an add-on, 3% cash back with the Rogers Red credit card, a 10GB bonus data promotion, and $0 hotspot promotion.", "metadata": {"activation_fee": true, "autopay_method": "credit, debit, bank account", "best_buy_gc": "N/A", "provider": "Fido", "plan_name": "40GB, Talk & Text - BYOP"}}
{"text": "Fido offers a mobile plan called \"60GB, Talk & Text - BYOP\" for $50 per month, down from the original price of $60, with a $10 discount available for customers who use Autopay. This plan provides 60 GB of high-speed 4G LTE data and includes hotspot capabilities, though it is not shareable. Customers can enjoy unlimited calling within Canada and to the U.S., along with 1000 international minutes to 27 countries, and roaming is available in Canada and the U.S. Texting is unlimited within Canada, but there are no unlimited options for the U.S. or international texts, though customers will receive 1000 international texts. The plan does not include HD video streaming or any included streaming services, but it comes with additional perks such as a $0 hotspot promo, 10GB bonus data promo, and 3% cash back when using the Rogers Red credit card.", "metadata": {"activation_fee": true, "autopay_method": "credit, debit, bank account", "best_buy_gc": "N/A", "provider": "Fido", "plan_name": "60GB, Talk & Text - BYOP"}}
{"text": "Koodo offers the Canada Wide Plan - 10GB for $40 per month, down from the original price of $50, with a discount available for customers who enroll in Autoay. This plan features 10 GB of high-speed 5G data, with unlimited calling within Canada and unlimited texting in Canada and international texting included. However, it does not offer unlimited calling to the US or international minutes. The plan does not include HD video streaming or any streaming services. Additionally, customers enjoy perks such as Shock-Free Data, the option to choose one free perk like the Unlimited Long Distance Pack, and pay-per-use data.", "metadata": {"activation_fee": true, "autopay_method": "bank account", "best_buy_gc": "$50", "provider": "Koodo", "plan_name": "Canada Wide Plan - 10GB"}}
{"text": "Koodo offers the Canada Wide Plan with 40GB of data for $45 per month, down from the original price of $55 when you sign up for Autopay. This plan provides unlimited calling within Canada and unlimited texting in Canada as well as unlimited international texting. While it includes 40GB of high-speed 5G data, this plan does not allow hotspot usage or shareable data. It also does not include unlimited calling to the U.S. or any international minutes. The plan comes with additional perks such as Shock-Free Data and the option to choose one free perk, which includes options like the Unlimited Long Distance Pack.", "metadata": {"activation_fee": true, "autopay_method": "bank account", "best_buy_gc": "N/A", "provider": "Koodo", "plan_name": "Canada Wide Plan - 40GB"}}
{"text": "The Koodo Canada Wide Plan - 60GB is priced at $50 per month, down from the original price of $60, with the discount available if you enroll in Autopay. This plan offers 60 GB of high-speed 5G data, and includes unlimited calling and texting within Canada. Texting is also unlimited for international messages. While the plan does not include unlimited calls to the US or any international calling minutes, it does cover roaming services within Canada. Additional perks of this plan include Shock-Free Data and the option to select one free perk, such as the Unlimited Long Distance Pack.", "metadata": {"activation_fee": true, "autopay_method": "bank account", "best_buy_gc": "N/A", "provider": "Koodo", "plan_name": "Canada Wide Plan - 60GB"}}
{"text": "Koodo offers the \"Canada Wide Plan - 100GB\" for $75 per month, down from the original price of $85, with a discount available for customers who set up $10 Autopay. This plan provides 100 GB of high-speed data on a 5G network. It includes unlimited calling within Canada, unlimited texting to Canada and international destinations, and while there are no options for unlimited calls to the US or international minutes, you can enjoy additional perks such as Shock-Free Data and the choice of one free perk, such as the Unlimited Long Distance Pack. There are no hotspot or shareable data features included in this plan, and video streaming is not available in HD.", "metadata": {"activation_fee": true, "autopay_method": "bank account", "best_buy_gc": "N/A", "provider": "Koodo", "plan_name": "Canada Wide Plan - 100GB"}}
